
## Plan Result




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_application_insights.appinsights
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.app_insights_key
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "civil-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.Insights/components/civil-service-aat"
        name                                  = "civil-service-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git" -> null
            "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-service.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://civil-aat.vault.azure.net/secrets/appinsights-connection-string/1479a84a33be4ec6a3dde203746f2b3c"
        name                    = "appinsights-connection-string"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git" -> null
            "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-service.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "appinsights civil-service-aat"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_key" {
        id                      = "https://civil-aat.vault.azure.net/secrets/appinsights-instrumentation-key/aca746bd1b464f1c89302103cb08b4f9"
        name                    = "appinsights-instrumentation-key"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git" -> null
            "application"         = "civil"
          + "builtFrom"           = "https://github.com/HMCTS/civil-service.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "appinsights civil-service-aat"
        }
        # (7 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat|civil-aat"
        name                       = "civil-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2928,"Program":"tfcmt","SHA1":"","Vars":{}} -->